# Homework 3 (40 pts)


Due Date: 11/12/2020 (Thursday 11:59 AM

Save Notebook file as :HW2_YourStudentID.ipynb

Upload to your Github and email the link to: jzhang@eastwest.edu

Subject: Homework 3 by YourStudentID and your name

In [1]:
%matplotlib inline
import pandas as pd

In [8]:
# limiting the display rows
pd.set_option('display.max_rows', 5)

In [9]:
sales = pd.read_csv('data/MarchSales.csv')
print(sales.shape)
sales

(107, 10)

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
0,2018-001,KRM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,2788
1,2018-002,RKM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,3245
...,...,...,...,...,...,...,...,...,...,...
105,2018-102,MAP,Chantalle,Desmarais,3/31/2018,Bedroom,Mattress,Paid in Full,Promotion,2000
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [48]:
print('Your Name and StudentID\n')

# Problem 1. (2 pt)

# Show the number of rows and columns in sales dataframe.
print(sales.shape)

Your Name and StudentID

(107, 10)
   Trans_No Operator Sales_First  Sales_Last      Date   Department  \
0  2018-001      KRM   Sebastian  Gruenewald  3/1/2018      Bedroom
1  2018-002      RKM   Sebastian  Gruenewald  3/1/2018      Bedroom
2  2018-003      MAP        Jade   Gallagher  3/1/2018  Living Room

                       Furniture Pay_Type Trans_Type  Amount
0                       Mattress  Finance  Promotion    2788
1                       Mattress  Finance  Promotion    3245
2  Sofa, Loveseat, Chair Package  Finance  Promotion   10000

----------------------------------------

     Trans_No Operator Sales_First  Sales_Last       Date   Department  \
104  2018-101      KRM   Sebastian  Gruenewald  3/31/2018      Bedroom
105  2018-102      MAP   Chantalle   Desmarais  3/31/2018      Bedroom
106  2018-103      KRM   Sebastian  Gruenewald  3/31/2018  Living Room

                 Furniture      Pay_Type Trans_Type  Amount
104  Bedroom Furniture Set       Finance  Promotion    5773
105               Mattress  Paid in Full  Promotion    2000
106             End Tables       Finance   Standard    2505

In [49]:
print('Your Name and StudentID\n')

# Problem 2 (2 pt)

# show the column names of the datafram 

print('----------------------------------------\n')
# show the index of the datafram

Your Name and StudentID

Index(['Trans_No', 'Operator', 'Sales_First', 'Sales_Last', 'Date',
       'Department', 'Furniture', 'Pay_Type', 'Trans_Type', 'Amount'],
      dtype='object')
----------------------------------------

RangeIndex(start=0, stop=107, step=1)

In [12]:
print('Your Name and StudentID\n')

# Problem 3 (2 pt)
# Only show Trans number

Your Name and StudentID

0      2018-001
1      2018-002
         ...
105    2018-102
106    2018-103
Name: Trans_No, Length: 107, dtype: object

In [14]:
print('Your Name and StudentID')

# Problem 4 (4 pt)
# Show Department without duplicate



print()
# Display department name as following format
print('Department')
print('---------------------------------------------')

Your Name and StudentID
['Bedroom' 'Living Room' 'Appliances' 'Dining Room']

Department
---------------------------------------------
Bedroom
Living Room
Appliances
Dining Room

In [50]:
print('Your Name and StudentID')

# Problem 5 (2 pt)
# Show the columns: Trans_No, Sales Representatives Name.

Your Name and StudentID

     Trans_No Sales_First  Sales_Last
0    2018-001   Sebastian  Gruenewald
1    2018-002   Sebastian  Gruenewald
..        ...         ...         ...
105  2018-102   Chantalle   Desmarais
106  2018-103   Sebastian  Gruenewald

[107 rows x 3 columns]

In [16]:
print('Your Name and StudentID\n')

# Problem 6 (2 pt)
# Show the columns: Trans_No, Sales Representatives Name. 
# (only show the first, third and fifth row)
# HitL use .loc

Your Name and StudentID

   Trans_No Sales_First  Sales_Last
0  2018-001   Sebastian  Gruenewald
2  2018-003        Jade   Gallagher
4  2018-005        Jade   Gallagher

In [17]:
print('Your Name and StudentID\n')

# Problem 7 (2 pt)
# Show all transactions in the department of Living Room

Your Name and StudentID

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
2,2018-003,MAP,Jade,Gallagher,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,10000
3,2018-004,MAP,Jade,Gallagher,3/1/2018,Living Room,End Tables,Finance,Promotion,1000
...,...,...,...,...,...,...,...,...,...,...
98,2018-095,COK,Sebastian,Gruenewald,3/29/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Standard,14275
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [18]:
print('Your Name and StudentID\n')

# Problem 8 (2 pts)
# Show all transaction in Living Room Department and Trans_Type is Promotion

Your Name and StudentID

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
2,2018-003,MAP,Jade,Gallagher,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,10000
3,2018-004,MAP,Jade,Gallagher,3/1/2018,Living Room,End Tables,Finance,Promotion,1000
...,...,...,...,...,...,...,...,...,...,...
73,2018-070,KRM,Ambrose,Sardelis,3/23/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12500
77,2018-074,MAP,Jade,Gallagher,3/24/2018,Living Room,Loveseat,Paid in Full,Promotion,1255

In [32]:
print('Your Name and StudentID')

# Problem 9 (2 pts)
# Show all transaction which amount is over 10000 or Pay_Type is Finance

Your Name and StudentID

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
0,2018-001,KRM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,2788
1,2018-002,RKM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,3245
...,...,...,...,...,...,...,...,...,...,...
104,2018-101,KRM,Sebastian,Gruenewald,3/31/2018,Bedroom,Bedroom Furniture Set,Finance,Promotion,5773
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [33]:
print('Your Name and StudentID')

# Problem 10 (2 pts)
# Show all transaction which amount is over 10000
# Only include columns: Trans_No, Furniture,Pay_Type, Amount

Your Name and StudentID

     Trans_No                      Furniture Pay_Type  Amount
5    2018-006  Sofa, Loveseat, Chair Package  Finance   12000
6    2018-006  Sofa, Loveseat, Chair Package  Finance   12000
..        ...                            ...      ...     ...
100  2018-097          Bedroom Furniture Set  Finance   14321
103  2018-100          Bedroom Furniture Set  Finance   11234

[11 rows x 4 columns]

In [35]:
print('Your Name and StudentID')

# Problem 11 ( 2 pt)
# Show the all transactions by Ambrose Sardelis

Your Name and StudentID

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
5,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
6,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
...,...,...,...,...,...,...,...,...,...,...
96,2018-093,MAP,Ambrose,Sardelis,3/28/2018,Bedroom,Mattress,Paid in Full,Standard,2000
97,2018-094,MAP,Ambrose,Sardelis,3/28/2018,Bedroom,Mattress,Paid in Full,Promotion,3245

In [36]:
print('Your Name and StudentID')

# Problem 12 ( 2 pt)
 
# Show the number of transactions by Ambrose Sardelis

Your Name and StudentID
Number of transactions by Ambrose Sardelis 24

In [37]:
print('Your Name and StudentID')

# Problem 13 ( 2 pt)
 
# Show the total sales by Ambrose Sardelis

Your Name and StudentID
Total sales of transactions by Ambrose Sardelis $ 131899

In [38]:
print('Your Name and StudentID')

# Problem 14 (2 pt)
# Show the total sales amount in March.

Your Name and StudentID
Total Sales: $ 493887

In [42]:
print('Your Name and StudentID\n')

# Problem 15 & 16 ( 4 pts)
# What the percentage of sales transactions in Promotion type among all sales transaction.

Your Name and StudentID

Total transaction number: 107
Number of sales transactions in Promotion: 52
percentage of sales transactions  48.60%

In [44]:
print('Your Name and StudentID\n')

# Problem 16 & 17 ( 4 pts)
# What the percentage of total sales from living room department among total sales.

Your Name and StudentID

March total sales : $ 493887
Living room department total sales : $ 155323
The percentage of total sales 31.45%

In [45]:
print('Your Name and StudentID\n')

# Problem 18 ( 2 pt)
# Show sales Amount from Bedroom and living room department. ( hint: Use OR Logic)

YourStudentID
Total Sales by Bedroom and living room department: $ 282018

In [47]:
print('Your Name and StudentID\n')

# Problem 19 ( 2 pt)
# Show the number of sales transactions from Bedroom department and Living Room department.
#  ( hint: Use OR Logic)

YourStudentID

50